// 20191203174532
// http://api.avatardata.cn/ZhouGongJieMeng/LookUp?key=c2289d89fb2a4701aee6204cd5f58783&keyword=%E6%A2%A6%E8%A7%81%E8%9B%87
const result = {
  total: 12,
  result: [
    {
      title: "梦见蛇咬我",
      content:
        "<div>心理学上说蛇的意象是男性，梦见蛇咬你，可能是你遇到一种困扰，也许由于你的一个重要的异性朋友，向你提出一种要求，就像是他想进一步发展你们的关系(男女间的亲密关系)，但你的心理好像还没做好准备，你在犹豫，但他已进开始了，并对你一直引导，这时你的心中可能已经做好了决定要进一步发展，于是梦中蛇就咬你了了。<br/>如果你是女性而且是已婚女性的话。有可能是怀孕了。如果是男性的话，被蛇咬说明最近你会走桃花运哦，是个好梦埃因为人们经常拿蛇比做美女啊，周公也是这么说的。   </div>",
      type: "生活类"
    },
    {
      title: "梦见蛇咬自己",
      content:
        "<div>孕妇怀孕期间梦见蛇咬自己，梦的好坏和梦境相关。<br/>孕妇梦见的是大蛇咬自己是好的预兆，在周公解梦里，孕妇的梦中出现大蛇，多预示会生男孩。<br/>孕妇梦见花蛇咬自己也是好梦，寓意多是指将会生女宝宝。<br/>孕妇梦见蛇咬自己的手指并咬出血，要多注意自己和宝宝的饮食健康，保证宝宝健康发育。   </div>",
      type: "其他类"
    },
    {
      title: "梦见蛇吃青蛙",
      content:
        "<div>梦见蛇吃青蛙，有两种说法，一种是会有财运，另一种会与人发生口角。   </div>",
      type: "动物类"
    },
    {
      title: "梦见蛇",
      content:
        "<div>梦见蛇，是凶兆。<br/>女人梦见蛇，自己和孩子都会病倒。<br/>梦见一对蛇，很快会分家。<br/>商人梦见一对蛇，能发大财。<br/>梦见蛇咬你自己，要交好运，生活会丰裕。<br/>但是梦见蛇咬自己妻子，是不祥之兆，会遇到忧愁不幸。<br/>梦见敌人被蛇咬伤，敌人会互相残杀，最后两败俱伤。<br/>梦见打死蛇，能征服敌人。<br/>梦见蛇钻进洞里，家里会被偷窃或被劫。<br/>梦见蛇捕捉老鼠或青蛙，会有不幸的消息。<br/>梦见蛇与猫争斗，所有的灾难都会过去。   </div>",
      type: "动物类"
    },
    {
      title: "梦见蛇和鱼",
      content:
        "<div>孕妇梦见蛇和鱼，是吉兆。不久后便会诞下个聪明健康的儿子。<br/>孕妇梦见鱼，是会生儿子的吉兆。<br/>孕妇做梦梦见吃鱼，多寓意母子平安、健康。<br/>孕妇梦见抓鱼则多由得子的倾向。<br/>而孕妇梦见捞鱼，多是怀孕生子的前兆。<br/>孕妇做梦梦见很多鱼则象征母子平安，生活将会富足且幸福。<br/>孕妇梦见鱼在水里游，胎梦，往往预示着母子健康。<br/>孕妇梦见捞鱼，多是怀孕生子的前兆。<br/>孕妇梦见杀鱼要提防胎儿健康。<br/>孕妇梦见钓了好多鱼，恐怕会生对龙凤胎或者多胞胎。<br/>孕妇梦见别人钓鱼，预示自己希望宝宝快点出生，像其他小孩一样健康、可爱。<br/>孕妇梦见蛇是生男生女的预兆。通常，孕妇梦见大蛇、蟒蛇或黑蛇预示会生男孩孕妇梦见小蛇、花蛇或白蛇入怀预示将会生女孩。<br/>孕妇梦见蛇缠身是吉兆，预示会生男孩不过另一方面也可能是代表孕妇怀孕压力大或近期烦恼多，提醒孕妇要注意放松心情。<br/>孕妇梦见蛇，多是得子的胎梦。梦见很多蛇，有生的双胞或者多胞胎的预兆。<br/>孕妇梦见自己杀蛇多有母子平安之寓意。<br/>孕妇梦见白蛇入怀，暗示梦者要生一个聪慧美丽的女儿。<br/>孕妇梦见青蛇，暗示梦者胎儿会很健康的发育。<br/>孕妇做梦梦见红蛇多有“喜得贵子“的美好寓意。<br/>孕妇梦见打死蛇自己和孩子的都会很健康。   </div>",
      type: "其他类"
    },
    {
      title: "梦见蛇缠身",
      content:
        "<div>梦见蛇缠身，预示着朋友会背叛自己或自己的身体会染病。<br/>梦见蛇缠自己，意味着梦者会看到一个人背叛自己的行径，这一点连自己都不敢相信。   </div>",
      type: "生活类"
    },
    {
      title: "梦见蛇",
      content:
        "<div>梦见蛇，是凶兆。<br/>女人梦见蛇，自己和孩子都会病倒。<br/>梦见一对蛇，很快会分家。<br/>商人梦见一对蛇，能发大财。<br/>梦见蛇咬你自己，要交好运，生活会丰裕。<br/>但是梦见蛇咬自己妻子，是不祥之兆，会遇到忧愁不幸。<br/>梦见敌人被蛇咬伤，敌人会互相残杀，最后两败俱伤。<br/>梦见打死蛇，能征服敌人。<br/>梦见蛇钻进洞里，家里会被偷窃或被劫。<br/>梦见蛇捕捉老鼠或青蛙，会有不幸的消息。<br/>梦见蛇与猫争斗，所有的灾难都会过去。   </div>",
      type: "动物类"
    },
    {
      title: "梦见蛇头",
      content:
        "<div>梦见蛇头：意味着得病受穷。<br/>寻找工作者梦见蛇头预兆面试：求职较多涉及到人际问题，团队合作精神仍然是考察的关键。共事者对你的评价较为重要。<br/>青年人梦见蛇头则近期运程：和顺，尊重他人的意见，就能获得大好时运。<br/>打工族梦见蛇头主职场：工作上会遇到让你沮丧的事情，甚至有成为替罪羔羊的可能。情绪有些急躁，和同事的相处变得紧张。   </div>",
      type: "动物类"
    },
    {
      title: "梦见蛇杖",
      content:
        "<div>蛇杖是被医生和医药机构用作治愈疾病的标志。梦中见到蛇杖，表示提醒注意健康事务一一或者是自身的健康，或者是关心其他亲戚朋友的健康。<br/>人们有时候在梦中表达关于健康状态的要求和期望。从心理的角度看，蛇杖意味着健康方面的条件略有欠缺，需要得到改善。<br/>梦中见到蛇杖，表示力量和协调与之相对立的事物。   </div>",
      type: "其他类"
    },
    {
      title: "梦见蛇咬人",
      content:
        "<div>梦到蛇咬人：是运势转好之预兆。<br/>梦到蛇咬人：感情运不错，即使双方之间有问题，也会顺利解决。<br/>单身贵族梦到蛇咬人预兆您的爱情：可成功。但双方不可我行我素。<br/>病人梦到蛇咬人则近期运程亨通，功名与利益双收；但运气过盛，必隐藏着倾衰的预兆，所以不能骄傲与怠慢。<br/>学子梦到蛇咬人预示考试成绩一般。<br/>梦见自己被蛇咬，意味着不怕凶险，将交上好运，生活富裕。<br/>梦见孩子被蛇咬，则意味着家庭不和，带来忧愁和不幸。<br/>梦见蛇咬你自己，要交好运，生活会丰裕。<br/>但是梦见蛇咬自己妻子，是不祥之兆，会遇到忧愁不幸。<br/>梦见被蛇咬，然后把蛇杀掉及后蛇起死回生，未婚的会找到理想对象已婚的男性会有婚外情或会有儿子。   </div>",
      type: "生活类"
    },
    {
      title: "梦见蛇吃鱼",
      content:
        "<div>孕妇梦自己吃鱼是预示母子健康；而梦见蛇吃鱼不同的梦境有不同的寓意。<br/>在周公解梦里，孕妇梦见蛇通常预示生男宝宝，而梦见鲤鱼则是预示生女宝宝。因此孕妇梦见蛇吃鲤鱼，是预示会得子。<br/>孕妇梦见蛇吃了很多鱼，你就要多关注宝宝的发育和健康。<br/>孕妇梦见鱼被大蛇或蟒蛇吃了，预示怀孕过程中会出现一些不好的事情，但最终可以顺利分娩；且宝宝以后会有所成就。<br/>孕妇梦见蛇吃死鱼，是不好的梦。做此梦的孕妇要注意自己的身体健康和宝宝的发育状况。   </div>",
      type: "其他类"
    },
    {
      title: "梦见蛇妖",
      content:
        "<div>梦见蛇妖，人头蛇身的妖怪向我走来，表示有一个虚伪的家伙在靠近你，不久将会露出她的真面目。   </div>",
      type: "鬼神类"
    }
  ],
  error_code: 0,
  reason: "Succes"
};
export default result;
